app/views/admins/show_book_history.html.erb

<tr>
<%borrows=member.borrow_books.where(book_id:@book.id)%>
---
SELECT `borrow_books`.* FROM `borrow_books` WHERE `borrow_books`.`member_id` = 10 AND `borrow_books`.`book_id` = 6