app/controllers/accessa_controller.rb

  def attempt_login
    if params[:email].present? && params[:password].present?
      found_user = Admin.where(:email => params[:email]).first
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`email` = 'test@admin'  ORDER BY `admins`.`id` ASC LIMIT 1