app/controllers/access_controller.rb

  def attempt_login
    if params[:email].present? && params[:password].present?
      found_user = Member.where(:email => params[:email]).first
---
SELECT  `members`.* FROM `members` WHERE `members`.`email` = '12345'  ORDER BY `members`.`id` ASC LIMIT 1