app/controllers/admins_controller.rb

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1
---
  def show
	@admin=Admin.find(params[:id])

INSERT INTO `admins` (`email`, `name`, `password_digest`, `created_at`, `updated_at`) VALUES ('pgomata@ncsu.edu', 'prasanth', '$2a$10$.Q0hkO/UvFL2WndbuFn5Ze1BhLq20ldZ7YkwDEeUER/ROpV1Q8uDq', '2015-09-24 08:15:28', '2015-09-24 08:15:28')
---
  def create
	@admin=Admin.new(admin_params)
	if @admin.save

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 5 LIMIT 1
---
  def edit
	@admin=Admin.find(params[:id])

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 5 LIMIT 1
UPDATE `admins` SET `name` = 'test admin name', `password_digest` = '$2a$10$RYYmbBcWOz05tftLBcMeH.anNKHUF5GV/V6WpKRfcNkS2SctxiaKG', `updated_at` = '2015-09-25 21:19:37' WHERE `admins`.`id` = 8
---
  def update
	@admin=Admin.find(params[:id])
	if @admin.update_attributes(admin_params)

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 3 LIMIT 1
---
  def delete
	@admin=Admin.find(params[:id])

DELETE FROM `admins` WHERE `admins`.`id` = 3
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 3 LIMIT 1
---
  def destroy
	admin=Admin.find(params[:id]).destroy

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT  `borrow_books`.* FROM `borrow_books` WHERE `borrow_books`.`book_id` = 1 LIMIT 1
SELECT `members`.* FROM `members` INNER JOIN `borrow_books` ON `members`.`id` = `borrow_books`.`member_id` WHERE `borrow_books`.`book_id` = 1
---
  def show_book
	@book=Book.find(params[:id])
	@borrow=BorrowBook.find_by_book_id(@book.id)
	if(@borrow!=nil) then
	@member=Member.find(@borrow.member_id)

INSERT INTO `books` (`ISBN`, `title`, `description`, `authors`, `created_at`, `updated_at`) VALUES ('12345', 'Timepass', 'bleh', 'Rohit', '2015-09-23 18:30:25', '2015-09-23 18:30:25')
---
  def create_book

	@book=Book.new(book_params)
	if @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def edit_book
	@book=Book.find(params[:id])

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `title` = 'Lord of the Rings', `updated_at` = '2015-09-23 19:09:15' WHERE `books`.`id` = 1
---
  def update_book
	@book=Book.find(params[:id])
	if @book.update_attributes(book_update_params)

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
SELECT `borrow_books`.* FROM `borrow_books` WHERE `borrow_books`.`return_date` IS NULL AND `borrow_books`.`book_id` = 4
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 13 LIMIT 1
UPDATE `books` SET `status` = 'Available', `updated_at` = '2015-09-26 03:33:45' WHERE `books`.`id` = 4
UPDATE `borrow_books` SET `return_date` = '2015-09-25', `updated_at` = '2015-09-26 03:33:45' WHERE `borrow_books`.`id` = 37
---
  def return_book
	@book=Book.find(params[:id])
	@borrow=BorrowBook.where(return_date:nil).where(book_id:@book.id)
	@member=Member.find(@borrow[0].member_id)
	@book.status="Available"
	time=Time.now
	@borrow[0].return_date=time.inspect
	if @borrow[0].save && @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
---
  def delete_book
	@book=Book.find(params[:id])

DELETE FROM `books` WHERE `books`.`id` = 3
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
---
  def destroy_book
	book=Book.find(params[:id]).destroy

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def show_book_history
	@book=Book.find(params[:id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = NULL LIMIT 1
---
  def show_member_history
	@member=Member.find(params[:id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
---
  def show_member
	@member=Member.find(params[:id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 2 LIMIT 1
---
   def delete_member
	@member=Member.find(params[:id])

DELETE FROM `members` WHERE `members`.`id` = 2
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 2 LIMIT 1
---
  def destroy_member
	member=Member.find(params[:id]).destroy