app/controllers/members_controller.rb

SELECT  `members`.* FROM `members` WHERE `members`.`id` = NULL LIMIT 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
SELECT `borrow_books`.* FROM `borrow_books` WHERE `borrow_books`.`return_date` IS NULL AND `borrow_books`.`book_id` = 1
UPDATE `books` SET `status` = 'Available', `updated_at` = '2015-09-25 06:25:29' WHERE `books`.`id` = 4
UPDATE `borrow_books` SET `return_date` = '2015-09-25', `updated_at` = '2015-09-25 06:25:29' WHERE `borrow_books`.`id` = 2
---
	def return_book
		@member=Member.find(params[:user_id])
		@book=Book.find(params[:id])
		@book.status="Available"
		@borrow=BorrowBook.where(return_date:nil).where(book_id:@book.id)
		#@borrow=BorrowBook.find_by_book_id(@book.id)
		time=Time.now
		@borrow[0].return_date=time.inspect
		if @borrow[0].save && @book.save

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 10 LIMIT 1
---
	def view_history
		@member=Member.find(params[:user_id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = NULL LIMIT 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 6 LIMIT 1
INSERT INTO `borrow_books` (`member_id`, `book_id`, `borrow_date`, `created_at`, `updated_at`) VALUES (10, 6, '2015-09-24', '2015-09-24 21:16:47', '2015-09-24 21:16:47')
UPDATE `books` SET `status` = 'Checked Out', `updated_at` = '2015-09-24 21:16:47' WHERE `books`.`id` = 6
---
	def checkout_book
		@member=Member.find(params[:user_id])
		@book=Book.find(params[:book_id])
		@book.status="Checked Out"
		@borrow=BorrowBook.new
		@borrow.member_id=@member.id
		@borrow.book_id=@book.id
		time=Time.now
		@borrow.borrow_date=time.inspect
		if @borrow.save && @book.save

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 10 LIMIT 1
---
	def index
	@member=Member.find(session[:user_id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
---
	def show
	@member=Member.find(params[:id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
---
	def edit
	@member=Member.find(params[:id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
UPDATE `members` SET `email` = 'coolboy07', `password_digest` = '$2a$10$I5tqGbmaRkOujt2v8Ik8MupldIdz.P/WvbK7l7XfYfzfnXpTiAn6K', `updated_at` = '2015-09-26 04:12:49' WHERE `members`.`id` = 14
---
  	def update
	@member=Member.find(params[:id])
	if @member.update_attributes(member_params)

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT  `borrow_books`.* FROM `borrow_books` WHERE `borrow_books`.`book_id` = 1 LIMIT 1
SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
---
	def show_book
	@book=Book.find(params[:id])
	@borrow=BorrowBook.find_by_book_id(@book.id)
	if(@borrow!=nil) then
	@member=Member.find(@borrow.member_id)

INSERT INTO `members` (`email`, `name`, `password_digest`, `created_at`, `updated_at`) VALUES ('fsdfdsf', 'fsdfdsfds', '$2a$10$Fj8VQNk7fEPrWfIdbKjqne0uVNfyvMHi5NTuovDdlDAhtX58x41gC', '2015-09-24 07:09:44', '2015-09-24 07:09:44')
---
        def create
	@member=Member.new(member_params)
	if @member.save