app/views/members/index.html.erb

SELECT `borrow_books`.* FROM `borrow_books` WHERE `borrow_books`.`return_date` IS NULL AND `borrow_books`.`book_id` = 6
---
<tr>
<%borrow=BorrowBook.where(return_date:nil).where(book_id:book)%>