app/views/members/view_history.html.erb

<tr>
<%borrows=book.borrow_books.where(member_id:@member.id)%>
---
SELECT `borrow_books`.* FROM `borrow_books` WHERE `borrow_books`.`book_id` = 4 AND `borrow_books`.`member_id` = 15